
# 常用颜色定义
BLACK       = (0, 0, 0)                     # 黑色
WHITE       = (255, 255, 255)               # 白色
RED         = (255, 0, 0)                   # 红色
GREEN       = (0, 255, 0)                   # 绿色
BLUE        = (0, 0, 255)                   # 蓝色
GRAY        = (64, 64, 64)                  # 灰色

# 具有设计感和科技感的颜色定义
GRAPHITE    = (80, 80, 80)                  # 石墨灰
MAROON      = (128, 0, 0)                   # 栗色
PEARL_WHITE = (240, 240, 240)               # 珍珠白
HAZE_BLUE   = (120, 144, 156)               # 雾蓝色
STEEL_GRAY  = (128, 128, 128)               # 钢铁灰
BRIGHT_BLUE = (0, 153, 255)                 # 亮蓝色
INDIGO      = (75, 0, 130)                  # 靛青色
SIENNA      = (160, 82, 45)                 # 赭色

GEMSTONE_BLUE   = (17, 100, 180)            # 宝石蓝
CHROME_YELLOW   = (255, 167, 0)             # 铬黄色
CORAL_RED       = (255, 64, 64)             # 珊瑚红
FIREBRICK_RED   = (178, 34, 34)             # 火砖红
LIME_GREEN      = (50, 205, 50)             # 酸橙绿
VIRIDIAN_GREEN      = (64, 130, 109)        # 碧绿色
TRANSPARENT_BLACK   = (0, 0, 0, 255)        # 透明黑色
TRANSPARENT_WHITE   = (255, 255, 255, 128)  # 透明白色
TRANSPARENT_NE      = (150, 150, 150, 128)     # panel颜色

"""
霜色 (Gainsboro): (220, 220, 220)。比普通的白色稍微偏灰一点，具有更高的质感和现代感，适合用于设计风格简约而不失高级感的场合。
烟白色 (Smoky White): (245, 245, 245)。比普通的白色略微带有一点淡淡的蓝色，看起来非常柔和舒适，适合用于创意或舒适的场合。
白杏色 (Peach Puff): (255, 218, 185)。这种白色带有一点淡淡的桃色调，比较适合用于温馨浪漫的场合，比如婚礼或情人节等。
米白色 (Antique White): (250, 235, 215)。这种白色带有淡淡的米色调，看起来比较古典和温暖，适合用于传统或优雅的场合。
雪白色 (Snow): (255, 250, 250)。这种白色非常纯净和清爽，看起来比较适合用于冷静、干净和现代感强的场合。
"""
# 霜色 (Gainsboro)
GAINSBORO = (220, 220, 220)

# 烟白色 (Smoky White)
SMOKY_WHITE = (245, 245, 245)

# 白杏色 (Peach Puff)
PEACH_PUFF = (255, 218, 185)

# 米白色 (Antique White)
ANTIQUE_WHITE = (250, 235, 215)

# 雪白色 (Snow)
SNOW = (255, 250, 250)


"""
墨黑色 (Jet Black): (52, 52, 52)。墨黑色是一种非常深沉的黑色，比普通黑色稍微偏蓝，看起来非常有质感和高级感，适合用于时尚和现代感强的场合。
铁灰色 (Iron Grey): (76, 76, 76)。铁灰色是一种比较深沉的灰黑色，看起来非常沉稳和大气，适合用于传统或成熟稳重的场合。
煤黑色 (Coal Black): (22, 22, 22)。煤黑色是一种非常深沉的黑色，比墨黑色稍微偏红，看起来非常浓郁和稳重，适合用于比较正式和重要的场合。
深灰色 (Dark Gray): (64, 64, 64)。深灰色是一种比较深沉的灰色，比铁灰色略微偏黑，看起来非常高级和稳重，适合用于正式和商务的场合。
暗夜黑色 (Midnight Black): (14, 22, 33)。暗夜黑色是一种非常深沉的黑色，带有一些深蓝色和暗紫色的调子，看起来非常神秘和高级，适合用于高端和富有想象力的场合。
"""
# 墨黑色 (Jet Black)
JET_BLACK = (52, 52, 52)

# 铁灰色 (Iron Grey)
IRON_GREY = (76, 76, 76)

# 煤黑色 (Coal Black)
COAL_BLACK = (22, 22, 22)

# 深灰色 (Dark Gray)
DARK_GRAY = (64, 64, 64)

# 暗夜黑色 (Midnight Black)
MIDNIGHT_BLACK = (14, 22, 33)



PURPLE_RED          = (78, 0, 77, 128)      # 紫红色，透明度50%
MELLOW_GREEN        = (28, 70, 38, 153)     # 草木绿，透明度60%
DARK_CYAN           = (0, 64, 64, 200)      # 暗青色，透明度70%
CHOCOLATE_BROWN     = (55, 20, 0, 102)      # 巧克力棕，透明度40%
BLACK_PURPLE        = (35, 0, 35, 204)      # 黑紫色，透明度80%
VIRIDIAN_GREEN      = (64, 130, 109)        # 碧绿色