# 1. 编写程序，计算区间[m,n]中的偶数之和（m，n从键盘输入，要求m，n都为整数且n>m）。程序文件名为P3_1.py。 运行结果如下（键盘输入内容用下划线标注）：请输入整数m:1请输入整数n(n>m):100m-n中所有偶数的和: 2550 请输入整数m:1请输入整数n(n>m):1000m-n中所有偶数的和:250500 提示：请先选择正确的语言Python 3.x，然后将程序代码复制到答案区。

m = int(input("请输入整数m:"))
n = int(input("请输入整数n(n>m):"))

sum = 0
for i in range(m, n + 1):
    if i % 2 == 0:
        sum += i

print("m-n中所有偶数的和:", sum)




# 2. 编写程序输出第m年到第n年（m，n从键盘输入，要求m，n都为整数且n>m）的所有闰年。程序文件名为P3_2.py。 运行结果如下（键盘输入内容用下划线标注）：请输入起始年份m:2000请输入终止年份n(n>m):22002000 2004 2008 2012 2016 2020 2024 2028 2032 2036 2040 2044 2048 2052 2056 2060 2064 2068 2072 2076 2080 2084 2088 2092 2096 2104 2108 2112 2116 2120 2124 2128 2132 2136 2140 2144 2148 2152 2156 2160 2164 2168 2172 2176 2180 2184 2188 2192 2196提示：请先选择正确的语言Python 3.x，然后将程序代码复制到答案区。

m = int(input("请输入起始年份m:"))
n = int(input("请输入终止年份n(n>m):"))

for i in range(m, n + 1):
    if i % 4 == 0 and i % 100 != 0 or i % 400 == 0:
        print(i, end=" ")



# 3. (程序题)编写程序，输入整数n（n>=0），分别利用for循环和while循环求n！。程序文件名为P3_3.py。 运行结果如下（键盘输入内容用下划线标注）：请输入非负整数n:5for循环:5!=120while循环:5!=120提示：请先选择正确的语言Python 3.x，然后将程序代码复制到答案区。

n = int(input("请输入非负整数n:"))

# for循环求n!
f = 1
for i in range(1, n + 1):
    f *= i
print("for循环:{}!={}".format(n, f))

# while循环求n!
f = 1
i = 1
while i <= n:
    f *= i
    i += 1
print("while循环:{}!={}".format(n, f))

